app/Controllers/Login.php

    public function autenticar()
    {
      $dados = $this->request->getVar();

      $login_model = new LoginModel();

      $login = $login_model->where('Usuario', $dados['Usuario'])
                           ->where('Senha', $dados['Senha'])
                           ->first();
---
SELECT *
FROM `login`
WHERE `Usuario` = 'admin'
AND `Senha` = '123456'
 LIMIT 1