app/Controllers/Produtos.php

    public function listar()
    {
        $produto_model = new ProdutoModel();
        $produtos = $produto_model->findAll();
---
SELECT *
FROM `produtos`